Tekla Open API Reference for Tekla Structures 2025
UserPropertyVisibilityEnum Enumeration
The visibility of the user property.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum UserPropertyVisibilityEnum
Public Enumeration UserPropertyVisibilityEnum
Members
Member name | Value | Description
VISIBILITY_NORMAL | 0 |  The user property is visible and the user can modify it.
VISIBILITY_READONLY | 1 |  The user property is visible but the user cannot modify it.
VISIBILITY_HIDDEN | 2 |  The user property is hidden.
See Also
Reference
Tekla.Structures.Catalogs Namespace